Masmiseim36/nxpSDK/devices/MKW37A4/MKW37A4.h
/* NV - Peripheral instance base addresses */
/** Peripheral FTFE_FlashConfig base address */
#define FTFE_FlashConfig_BASE                    (0x400u)
/** Peripheral FTFE_FlashConfig base pointer */
#define FTFE_FlashConfig                         ((NV_Type *)FTFE_FlashConfig_BASE)
/** Array initializer of NV peripheral base addresses */
#define NV_BASE_ADDRS                            { FTFE_FlashConfig_BASE }
/** Array initializer of NV peripheral base pointers */
#define NV_BASE_PTRS                             { FTFE_FlashConfig }

/*!
 * @}
 */ /* end of group NV_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PFLEXNVM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PFLEXNVM_Peripheral_Access_Layer PFLEXNVM Peripheral Access Layer
 * @{
 */

/** PFLEXNVM - Register Layout Typedef */
typedef struct {
  __IO uint32_t PFAPR;                             /**< Flash Access Protection Register, offset: 0x0 */
  __IO uint32_t PFB0CR;                            /**< Flash Bank 0 Control Register, offset: 0x4 */
  __IO uint32_t RESERVED_PFB1CR;                   /**< Reserved Flash Bank 1 Control Register, offset: 0x8 */
       uint8_t RESERVED_0[372];
  __IO uint32_t TAGVDW0S[4];                       /**< Cache Tag Storage, array offset: 0x180, array step: 0x4 */
  __IO uint32_t TAGVDW1S[4];                       /**< Cache Tag Storage, array offset: 0x190, array step: 0x4 */
  __IO uint32_t TAGVDW2S[4];                       /**< Cache Tag Storage, array offset: 0x1A0, array step: 0x4 */
  __IO uint32_t TAGVDW3S[4];                       /**< Cache Tag Storage, array offset: 0x1B0, array step: 0x4 */
       uint8_t RESERVED_1[320];
  __IO uint32_t DATAW0S0U;                         /**< Cache Data Storage (upper word), offset: 0x300 */
  __IO uint32_t DATAW0S0L;                         /**< Cache Data Storage (lower word), offset: 0x304 */
  __IO uint32_t DATAW0S1U;                         /**< Cache Data Storage (upper word), offset: 0x308 */
  __IO uint32_t DATAW0S1L;                         /**< Cache Data Storage (lower word), offset: 0x30C */
  __IO uint32_t DATAW0S2U;                         /**< Cache Data Storage (upper word), offset: 0x310 */
  __IO uint32_t DATAW0S2L;                         /**< Cache Data Storage (lower word), offset: 0x314 */
  __IO uint32_t DATAW0S3U;                         /**< Cache Data Storage (upper word), offset: 0x318 */
  __IO uint32_t DATAW0S3L;                         /**< Cache Data Storage (lower word), offset: 0x31C */
  __IO uint32_t DATAW1S0U;                         /**< Cache Data Storage (upper word), offset: 0x320 */
  __IO uint32_t DATAW1S0L;                         /**< Cache Data Storage (lower word), offset: 0x324 */
  __IO uint32_t DATAW1S1U;                         /**< Cache Data Storage (upper word), offset: 0x328 */
  __IO uint32_t DATAW1S1L;                         /**< Cache Data Storage (lower word), offset: 0x32C */
  __IO uint32_t DATAW1S2U;                         /**< Cache Data Storage (upper word), offset: 0x330 */
  __IO uint32_t DATAW1S2L;                         /**< Cache Data Storage (lower word), offset: 0x334 */
  __IO uint32_t DATAW1S3U;                         /**< Cache Data Storage (upper word), offset: 0x338 */
  __IO uint32_t DATAW1S3L;                         /**< Cache Data Storage (lower word), offset: 0x33C */
  __IO uint32_t DATAW2S0U;                         /**< Cache Data Storage (upper word), offset: 0x340 */
  __IO uint32_t DATAW2S0L;                         /**< Cache Data Storage (lower word), offset: 0x344 */
  __IO uint32_t DATAW2S1U;                         /**< Cache Data Storage (upper word), offset: 0x348 */
  __IO uint32_t DATAW2S1L;                         /**< Cache Data Storage (lower word), offset: 0x34C */
  __IO uint32_t DATAW2S2U;                         /**< Cache Data Storage (upper word), offset: 0x350 */
  __IO uint32_t DATAW2S2L;                         /**< Cache Data Storage (lower word), offset: 0x354 */
  __IO uint32_t DATAW2S3U;                         /**< Cache Data Storage (upper word), offset: 0x358 */
  __IO uint32_t DATAW2S3L;                         /**< Cache Data Storage (lower word), offset: 0x35C */
  __IO uint32_t DATAW3S0U;                         /**< Cache Data Storage (upper word), offset: 0x360 */
  __IO uint32_t DATAW3S0L;                         /**< Cache Data Storage (lower word), offset: 0x364 */
  __IO uint32_t DATAW3S1U;                         /**< Cache Data Storage (upper word), offset: 0x368 */
  __IO uint32_t DATAW3S1L;                         /**< Cache Data Storage (lower word), offset: 0x36C */
  __IO uint32_t DATAW3S2U;                         /**< Cache Data Storage (upper word), offset: 0x370 */
  __IO uint32_t DATAW3S2L;                         /**< Cache Data Storage (lower word), offset: 0x374 */
  __IO uint32_t DATAW3S3U;                         /**< Cache Data Storage (upper word), offset: 0x378 */
  __IO uint32_t DATAW3S3L;                         /**< Cache Data Storage (lower word), offset: 0x37C */
} PFLEXNVM_Type;

/* ----------------------------------------------------------------------------
   -- PFLEXNVM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PFLEXNVM_Register_Masks PFLEXNVM Register Masks
 * @{
 */

/*! @name PFAPR - Flash Access Protection Register */
/*! @{ */
#define PFLEXNVM_PFAPR_M0AP_MASK                 (0x3U)
#define PFLEXNVM_PFAPR_M0AP_SHIFT                (0U)
/*! M0AP - Master 0 Access Protection
 *  0b00..No access may be performed by this master
 *  0b01..Only read accesses may be performed by this master
 *  0b10..Only write accesses may be performed by this master
 *  0b11..Both read and write accesses may be performed by this master
 */
#define PFLEXNVM_PFAPR_M0AP(x)                   (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFAPR_M0AP_SHIFT)) & PFLEXNVM_PFAPR_M0AP_MASK)
#define PFLEXNVM_PFAPR_M1AP_MASK                 (0xCU)
#define PFLEXNVM_PFAPR_M1AP_SHIFT                (2U)
/*! M1AP - Master 1 Access Protection
 *  0b00..No access may be performed by this master
 *  0b01..Only read accesses may be performed by this master
 *  0b10..Only write accesses may be performed by this master
 *  0b11..Both read and write accesses may be performed by this master
 */
#define PFLEXNVM_PFAPR_M1AP(x)                   (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFAPR_M1AP_SHIFT)) & PFLEXNVM_PFAPR_M1AP_MASK)
#define PFLEXNVM_PFAPR_M2AP_MASK                 (0x30U)
#define PFLEXNVM_PFAPR_M2AP_SHIFT                (4U)
/*! M2AP - Master 2 Access Protection
 *  0b00..No access may be performed by this master
 *  0b01..Only read accesses may be performed by this master
 *  0b10..Only write accesses may be performed by this master
 *  0b11..Both read and write accesses may be performed by this master
 */
#define PFLEXNVM_PFAPR_M2AP(x)                   (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFAPR_M2AP_SHIFT)) & PFLEXNVM_PFAPR_M2AP_MASK)
#define PFLEXNVM_PFAPR_M0PFD_MASK                (0x10000U)
#define PFLEXNVM_PFAPR_M0PFD_SHIFT               (16U)
/*! M0PFD - Master 0 Prefetch Disable
 *  0b0..Prefetching for this master is enabled.
 *  0b1..Prefetching for this master is disabled.
 */
#define PFLEXNVM_PFAPR_M0PFD(x)                  (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFAPR_M0PFD_SHIFT)) & PFLEXNVM_PFAPR_M0PFD_MASK)
#define PFLEXNVM_PFAPR_M1PFD_MASK                (0x20000U)
#define PFLEXNVM_PFAPR_M1PFD_SHIFT               (17U)
/*! M1PFD - Master 1 Prefetch Disable
 *  0b0..Prefetching for this master is enabled.
 *  0b1..Prefetching for this master is disabled.
 */
#define PFLEXNVM_PFAPR_M1PFD(x)                  (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFAPR_M1PFD_SHIFT)) & PFLEXNVM_PFAPR_M1PFD_MASK)
#define PFLEXNVM_PFAPR_M2PFD_MASK                (0x40000U)
#define PFLEXNVM_PFAPR_M2PFD_SHIFT               (18U)
/*! M2PFD - Master 2 Prefetch Disable
 *  0b0..Prefetching for this master is enabled.
 *  0b1..Prefetching for this master is disabled.
 */
#define PFLEXNVM_PFAPR_M2PFD(x)                  (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFAPR_M2PFD_SHIFT)) & PFLEXNVM_PFAPR_M2PFD_MASK)
/*! @} */

/*! @name PFB0CR - Flash Bank 0 Control Register */
/*! @{ */
#define PFLEXNVM_PFB0CR_B0SEBE_MASK              (0x1U)
#define PFLEXNVM_PFB0CR_B0SEBE_SHIFT             (0U)
/*! B0SEBE - Bank 0 Single Entry Buffer Enable
 *  0b0..Single entry buffer is disabled.
 *  0b1..Single entry buffer is enabled.
 */
#define PFLEXNVM_PFB0CR_B0SEBE(x)                (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_B0SEBE_SHIFT)) & PFLEXNVM_PFB0CR_B0SEBE_MASK)
#define PFLEXNVM_PFB0CR_B0IPE_MASK               (0x2U)
#define PFLEXNVM_PFB0CR_B0IPE_SHIFT              (1U)
/*! B0IPE - Bank 0 Instruction Prefetch Enable
 *  0b0..Do not prefetch in response to instruction fetches.
 *  0b1..Enable prefetches in response to instruction fetches.
 */
#define PFLEXNVM_PFB0CR_B0IPE(x)                 (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_B0IPE_SHIFT)) & PFLEXNVM_PFB0CR_B0IPE_MASK)
#define PFLEXNVM_PFB0CR_B0DPE_MASK               (0x4U)
#define PFLEXNVM_PFB0CR_B0DPE_SHIFT              (2U)
/*! B0DPE - Bank 0 Data Prefetch Enable
 *  0b0..Do not prefetch in response to data references.
 *  0b1..Enable prefetches in response to data references.
 */
#define PFLEXNVM_PFB0CR_B0DPE(x)                 (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_B0DPE_SHIFT)) & PFLEXNVM_PFB0CR_B0DPE_MASK)
#define PFLEXNVM_PFB0CR_B0ICE_MASK               (0x8U)
#define PFLEXNVM_PFB0CR_B0ICE_SHIFT              (3U)
/*! B0ICE - Bank 0 Instruction Cache Enable
 *  0b0..Do not cache instruction fetches.
 *  0b1..Cache instruction fetches.
 */
#define PFLEXNVM_PFB0CR_B0ICE(x)                 (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_B0ICE_SHIFT)) & PFLEXNVM_PFB0CR_B0ICE_MASK)
#define PFLEXNVM_PFB0CR_B0DCE_MASK               (0x10U)
#define PFLEXNVM_PFB0CR_B0DCE_SHIFT              (4U)
/*! B0DCE - Bank 0 Data Cache Enable
 *  0b0..Do not cache data references.
 *  0b1..Cache data references.
 */
#define PFLEXNVM_PFB0CR_B0DCE(x)                 (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_B0DCE_SHIFT)) & PFLEXNVM_PFB0CR_B0DCE_MASK)
#define PFLEXNVM_PFB0CR_CRC_MASK                 (0xE0U)
#define PFLEXNVM_PFB0CR_CRC_SHIFT                (5U)
/*! CRC - Cache Replacement Control
 *  0b000..LRU replacement algorithm per set across all four ways
 *  0b001..Reserved
 *  0b010..Independent LRU with ways [0-1] for ifetches, [2-3] for data
 *  0b011..Independent LRU with ways [0-2] for ifetches, [3] for data
 *  0b1xx..Reserved
 */
#define PFLEXNVM_PFB0CR_CRC(x)                   (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_CRC_SHIFT)) & PFLEXNVM_PFB0CR_CRC_MASK)
#define PFLEXNVM_PFB0CR_B0MW_MASK                (0x60000U)
#define PFLEXNVM_PFB0CR_B0MW_SHIFT               (17U)
/*! B0MW - Bank 0 Memory Width
 *  0b00..32 bits
 *  0b01..64 bits
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define PFLEXNVM_PFB0CR_B0MW(x)                  (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_B0MW_SHIFT)) & PFLEXNVM_PFB0CR_B0MW_MASK)
#define PFLEXNVM_PFB0CR_S_B_INV_MASK             (0x80000U)
#define PFLEXNVM_PFB0CR_S_B_INV_SHIFT            (19U)
/*! S_B_INV - Invalidate Prefetch Speculation Buffer
 *  0b0..Speculation buffer and single entry buffer are not affected.
 *  0b1..Invalidate (clear) speculation buffer and single entry buffer.
 */
#define PFLEXNVM_PFB0CR_S_B_INV(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_S_B_INV_SHIFT)) & PFLEXNVM_PFB0CR_S_B_INV_MASK)
#define PFLEXNVM_PFB0CR_CINV_WAY_MASK            (0xF00000U)
#define PFLEXNVM_PFB0CR_CINV_WAY_SHIFT           (20U)
/*! CINV_WAY - Cache Invalidate Way x
 *  0b0000..No cache way invalidation for the corresponding cache
 *  0b0001..Invalidate cache way for the corresponding cache: clear the tag, data, and vld bits of ways selected
 */
#define PFLEXNVM_PFB0CR_CINV_WAY(x)              (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_CINV_WAY_SHIFT)) & PFLEXNVM_PFB0CR_CINV_WAY_MASK)
#define PFLEXNVM_PFB0CR_CLCK_WAY_MASK            (0xF000000U)
#define PFLEXNVM_PFB0CR_CLCK_WAY_SHIFT           (24U)
/*! CLCK_WAY - Cache Lock Way x
 *  0b0000..Cache way is unlocked and may be displaced
 *  0b0001..Cache way is locked and its contents are not displaced
 */
#define PFLEXNVM_PFB0CR_CLCK_WAY(x)              (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_CLCK_WAY_SHIFT)) & PFLEXNVM_PFB0CR_CLCK_WAY_MASK)
#define PFLEXNVM_PFB0CR_B0RWSC_MASK              (0xF0000000U)
#define PFLEXNVM_PFB0CR_B0RWSC_SHIFT             (28U)
/*! B0RWSC - Bank 0 Read Wait State Control
 */
#define PFLEXNVM_PFB0CR_B0RWSC(x)                (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_PFB0CR_B0RWSC_SHIFT)) & PFLEXNVM_PFB0CR_B0RWSC_MASK)
/*! @} */

/*! @name RESERVED_PFB1CR - Reserved Flash Bank 1 Control Register */
/*! @{ */
#define PFLEXNVM_RESERVED_PFB1CR_B1SEBE_MASK     (0x1U)
#define PFLEXNVM_RESERVED_PFB1CR_B1SEBE_SHIFT    (0U)
/*! B1SEBE - Bank 1 Single Entry Buffer Enable
 *  0b0..Single entry buffer is disabled.
 *  0b1..Single entry buffer is enabled.
 */
#define PFLEXNVM_RESERVED_PFB1CR_B1SEBE(x)       (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_RESERVED_PFB1CR_B1SEBE_SHIFT)) & PFLEXNVM_RESERVED_PFB1CR_B1SEBE_MASK)
#define PFLEXNVM_RESERVED_PFB1CR_B1IPE_MASK      (0x2U)
#define PFLEXNVM_RESERVED_PFB1CR_B1IPE_SHIFT     (1U)
/*! B1IPE - Bank 1 Instruction Prefetch Enable
 *  0b0..Do not prefetch in response to instruction fetches.
 *  0b1..Enable prefetches in response to instruction fetches.
 */
#define PFLEXNVM_RESERVED_PFB1CR_B1IPE(x)        (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_RESERVED_PFB1CR_B1IPE_SHIFT)) & PFLEXNVM_RESERVED_PFB1CR_B1IPE_MASK)
#define PFLEXNVM_RESERVED_PFB1CR_B1DPE_MASK      (0x4U)
#define PFLEXNVM_RESERVED_PFB1CR_B1DPE_SHIFT     (2U)
/*! B1DPE - Bank 1 Data Prefetch Enable
 *  0b0..Do not prefetch in response to data references.
 *  0b1..Enable prefetches in response to data references.
 */
#define PFLEXNVM_RESERVED_PFB1CR_B1DPE(x)        (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_RESERVED_PFB1CR_B1DPE_SHIFT)) & PFLEXNVM_RESERVED_PFB1CR_B1DPE_MASK)
#define PFLEXNVM_RESERVED_PFB1CR_B1ICE_MASK      (0x8U)
#define PFLEXNVM_RESERVED_PFB1CR_B1ICE_SHIFT     (3U)
/*! B1ICE - Bank 1 Instruction Cache Enable
 *  0b0..Do not cache instruction fetches.
 *  0b1..Cache instruction fetches.
 */
#define PFLEXNVM_RESERVED_PFB1CR_B1ICE(x)        (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_RESERVED_PFB1CR_B1ICE_SHIFT)) & PFLEXNVM_RESERVED_PFB1CR_B1ICE_MASK)
#define PFLEXNVM_RESERVED_PFB1CR_B1DCE_MASK      (0x10U)
#define PFLEXNVM_RESERVED_PFB1CR_B1DCE_SHIFT     (4U)
/*! B1DCE - Bank 1 Data Cache Enable
 *  0b0..Do not cache data references.
 *  0b1..Cache data references.
 */
#define PFLEXNVM_RESERVED_PFB1CR_B1DCE(x)        (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_RESERVED_PFB1CR_B1DCE_SHIFT)) & PFLEXNVM_RESERVED_PFB1CR_B1DCE_MASK)
#define PFLEXNVM_RESERVED_PFB1CR_B1MW_MASK       (0x60000U)
#define PFLEXNVM_RESERVED_PFB1CR_B1MW_SHIFT      (17U)
/*! B1MW - Bank 1 Memory Width
 *  0b00..32 bits
 *  0b01..64 bits
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define PFLEXNVM_RESERVED_PFB1CR_B1MW(x)         (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_RESERVED_PFB1CR_B1MW_SHIFT)) & PFLEXNVM_RESERVED_PFB1CR_B1MW_MASK)
#define PFLEXNVM_RESERVED_PFB1CR_B1RWSC_MASK     (0xF0000000U)
#define PFLEXNVM_RESERVED_PFB1CR_B1RWSC_SHIFT    (28U)
/*! B1RWSC - Bank 1 Read Wait State Control
 */
#define PFLEXNVM_RESERVED_PFB1CR_B1RWSC(x)       (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_RESERVED_PFB1CR_B1RWSC_SHIFT)) & PFLEXNVM_RESERVED_PFB1CR_B1RWSC_MASK)
/*! @} */

/*! @name TAGVDW0S - Cache Tag Storage */
/*! @{ */
#define PFLEXNVM_TAGVDW0S_valid_MASK             (0x1U)
#define PFLEXNVM_TAGVDW0S_valid_SHIFT            (0U)
/*! valid - 1-bit valid for cache entry
 */
#define PFLEXNVM_TAGVDW0S_valid(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_TAGVDW0S_valid_SHIFT)) & PFLEXNVM_TAGVDW0S_valid_MASK)
#define PFLEXNVM_TAGVDW0S_tag_MASK               (0x7FFC0U)
#define PFLEXNVM_TAGVDW0S_tag_SHIFT              (6U)
/*! tag - 13-bit tag for cache entry
 */
#define PFLEXNVM_TAGVDW0S_tag(x)                 (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_TAGVDW0S_tag_SHIFT)) & PFLEXNVM_TAGVDW0S_tag_MASK)
/*! @} */

