Masmiseim36/nxpSDK/devices/MKW37A4/MKW37A4.h
/*! @name DATAW1S1U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW1S1U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW1S1U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW1S1U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW1S1U_data_SHIFT)) & PFLEXNVM_DATAW1S1U_data_MASK)
/*! @} */

/*! @name DATAW1S1L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW1S1L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW1S1L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW1S1L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW1S1L_data_SHIFT)) & PFLEXNVM_DATAW1S1L_data_MASK)
/*! @} */

/*! @name DATAW1S2U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW1S2U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW1S2U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW1S2U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW1S2U_data_SHIFT)) & PFLEXNVM_DATAW1S2U_data_MASK)
/*! @} */

/*! @name DATAW1S2L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW1S2L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW1S2L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW1S2L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW1S2L_data_SHIFT)) & PFLEXNVM_DATAW1S2L_data_MASK)
/*! @} */

/*! @name DATAW1S3U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW1S3U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW1S3U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW1S3U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW1S3U_data_SHIFT)) & PFLEXNVM_DATAW1S3U_data_MASK)
/*! @} */

/*! @name DATAW1S3L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW1S3L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW1S3L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW1S3L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW1S3L_data_SHIFT)) & PFLEXNVM_DATAW1S3L_data_MASK)
/*! @} */

/*! @name DATAW2S0U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW2S0U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW2S0U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW2S0U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW2S0U_data_SHIFT)) & PFLEXNVM_DATAW2S0U_data_MASK)
/*! @} */

/*! @name DATAW2S0L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW2S0L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW2S0L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW2S0L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW2S0L_data_SHIFT)) & PFLEXNVM_DATAW2S0L_data_MASK)
/*! @} */

/*! @name DATAW2S1U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW2S1U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW2S1U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW2S1U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW2S1U_data_SHIFT)) & PFLEXNVM_DATAW2S1U_data_MASK)
/*! @} */

/*! @name DATAW2S1L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW2S1L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW2S1L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW2S1L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW2S1L_data_SHIFT)) & PFLEXNVM_DATAW2S1L_data_MASK)
/*! @} */

/*! @name DATAW2S2U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW2S2U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW2S2U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW2S2U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW2S2U_data_SHIFT)) & PFLEXNVM_DATAW2S2U_data_MASK)
/*! @} */

/*! @name DATAW2S2L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW2S2L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW2S2L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW2S2L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW2S2L_data_SHIFT)) & PFLEXNVM_DATAW2S2L_data_MASK)
/*! @} */

/*! @name DATAW2S3U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW2S3U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW2S3U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW2S3U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW2S3U_data_SHIFT)) & PFLEXNVM_DATAW2S3U_data_MASK)
/*! @} */

/*! @name DATAW2S3L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW2S3L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW2S3L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW2S3L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW2S3L_data_SHIFT)) & PFLEXNVM_DATAW2S3L_data_MASK)
/*! @} */

/*! @name DATAW3S0U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW3S0U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW3S0U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW3S0U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW3S0U_data_SHIFT)) & PFLEXNVM_DATAW3S0U_data_MASK)
/*! @} */

/*! @name DATAW3S0L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW3S0L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW3S0L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW3S0L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW3S0L_data_SHIFT)) & PFLEXNVM_DATAW3S0L_data_MASK)
/*! @} */

/*! @name DATAW3S1U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW3S1U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW3S1U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW3S1U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW3S1U_data_SHIFT)) & PFLEXNVM_DATAW3S1U_data_MASK)
/*! @} */

/*! @name DATAW3S1L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW3S1L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW3S1L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW3S1L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW3S1L_data_SHIFT)) & PFLEXNVM_DATAW3S1L_data_MASK)
/*! @} */

