Masmiseim36/nxpSDK/devices/MKW37A4/MKW37A4.h
/*! @name DATAW3S2U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW3S2U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW3S2U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW3S2U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW3S2U_data_SHIFT)) & PFLEXNVM_DATAW3S2U_data_MASK)
/*! @} */

/*! @name DATAW3S2L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW3S2L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW3S2L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW3S2L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW3S2L_data_SHIFT)) & PFLEXNVM_DATAW3S2L_data_MASK)
/*! @} */

/*! @name DATAW3S3U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW3S3U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW3S3U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW3S3U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW3S3U_data_SHIFT)) & PFLEXNVM_DATAW3S3U_data_MASK)
/*! @} */

/*! @name DATAW3S3L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW3S3L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW3S3L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW3S3L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW3S3L_data_SHIFT)) & PFLEXNVM_DATAW3S3L_data_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PFLEXNVM_Register_Masks */


/* PFLEXNVM - Peripheral instance base addresses */
/** Peripheral PFLEXNVM base address */
#define PFLEXNVM_BASE                            (0x4001F000u)
/** Peripheral PFLEXNVM base pointer */
#define PFLEXNVM                                 ((PFLEXNVM_Type *)PFLEXNVM_BASE)
/** Array initializer of PFLEXNVM peripheral base addresses */
#define PFLEXNVM_BASE_ADDRS                      { PFLEXNVM_BASE }
/** Array initializer of PFLEXNVM peripheral base pointers */
#define PFLEXNVM_BASE_PTRS                       { PFLEXNVM }

/*!
 * @}
 */ /* end of group PFLEXNVM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PIT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PIT_Peripheral_Access_Layer PIT Peripheral Access Layer
 * @{
 */

/** PIT - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< PIT Module Control Register, offset: 0x0 */
       uint8_t RESERVED_0[220];
  __I  uint32_t LTMR64H;                           /**< PIT Upper Lifetime Timer Register, offset: 0xE0 */
  __I  uint32_t LTMR64L;                           /**< PIT Lower Lifetime Timer Register, offset: 0xE4 */
       uint8_t RESERVED_1[24];
  struct {                                         /* offset: 0x100, array step: 0x10 */
    __IO uint32_t LDVAL;                             /**< Timer Load Value Register, array offset: 0x100, array step: 0x10 */
    __I  uint32_t CVAL;                              /**< Current Timer Value Register, array offset: 0x104, array step: 0x10 */
    __IO uint32_t TCTRL;                             /**< Timer Control Register, array offset: 0x108, array step: 0x10 */
    __IO uint32_t TFLG;                              /**< Timer Flag Register, array offset: 0x10C, array step: 0x10 */
  } CHANNEL[2];
} PIT_Type;

/* ----------------------------------------------------------------------------
   -- PIT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PIT_Register_Masks PIT Register Masks
 * @{
 */

/*! @name MCR - PIT Module Control Register */
/*! @{ */
#define PIT_MCR_FRZ_MASK                         (0x1U)
#define PIT_MCR_FRZ_SHIFT                        (0U)
/*! FRZ - Freeze
 *  0b0..Timers continue to run in Debug mode.
 *  0b1..Timers are stopped in Debug mode.
 */
#define PIT_MCR_FRZ(x)                           (((uint32_t)(((uint32_t)(x)) << PIT_MCR_FRZ_SHIFT)) & PIT_MCR_FRZ_MASK)
#define PIT_MCR_MDIS_MASK                        (0x2U)
#define PIT_MCR_MDIS_SHIFT                       (1U)
/*! MDIS - Module Disable for PIT
 *  0b0..Clock for standard PIT timers is enabled.
 *  0b1..Clock for standard PIT timers is disabled.
 */
#define PIT_MCR_MDIS(x)                          (((uint32_t)(((uint32_t)(x)) << PIT_MCR_MDIS_SHIFT)) & PIT_MCR_MDIS_MASK)
/*! @} */

/*! @name LTMR64H - PIT Upper Lifetime Timer Register */
/*! @{ */
#define PIT_LTMR64H_LTH_MASK                     (0xFFFFFFFFU)
#define PIT_LTMR64H_LTH_SHIFT                    (0U)
/*! LTH - Life Timer value
 */
#define PIT_LTMR64H_LTH(x)                       (((uint32_t)(((uint32_t)(x)) << PIT_LTMR64H_LTH_SHIFT)) & PIT_LTMR64H_LTH_MASK)
/*! @} */

/*! @name LTMR64L - PIT Lower Lifetime Timer Register */
/*! @{ */
#define PIT_LTMR64L_LTL_MASK                     (0xFFFFFFFFU)
#define PIT_LTMR64L_LTL_SHIFT                    (0U)
/*! LTL - Life Timer value
 */
#define PIT_LTMR64L_LTL(x)                       (((uint32_t)(((uint32_t)(x)) << PIT_LTMR64L_LTL_SHIFT)) & PIT_LTMR64L_LTL_MASK)
/*! @} */

/*! @name LDVAL - Timer Load Value Register */
/*! @{ */
#define PIT_LDVAL_TSV_MASK                       (0xFFFFFFFFU)
#define PIT_LDVAL_TSV_SHIFT                      (0U)
/*! TSV - Timer Start Value
 */
#define PIT_LDVAL_TSV(x)                         (((uint32_t)(((uint32_t)(x)) << PIT_LDVAL_TSV_SHIFT)) & PIT_LDVAL_TSV_MASK)
/*! @} */

/* The count of PIT_LDVAL */
#define PIT_LDVAL_COUNT                          (2U)

/*! @name CVAL - Current Timer Value Register */
/*! @{ */
#define PIT_CVAL_TVL_MASK                        (0xFFFFFFFFU)
#define PIT_CVAL_TVL_SHIFT                       (0U)
/*! TVL - Current Timer Value
 */
#define PIT_CVAL_TVL(x)                          (((uint32_t)(((uint32_t)(x)) << PIT_CVAL_TVL_SHIFT)) & PIT_CVAL_TVL_MASK)
/*! @} */

/* The count of PIT_CVAL */
#define PIT_CVAL_COUNT                           (2U)

